import pulp

# Створення змінної проблеми:
problem = pulp.LpProblem("Максимізація_Виробництва_Напоїв", pulp.LpMaximize)

# Змінні рішення
x = pulp.LpVariable("Лимонад", lowBound=0, cat='Integer')  # Кількість одиниць лимонаду для виробництва
y = pulp.LpVariable("Фруктовий_сік", lowBound=0, cat='Integer')  # Кількість одиниць фруктового соку для виробництва

# Цільова функція
problem += x + y, "Загальне_Виробництво"

# Обмеження
problem += 2 * x + 1 * y <= 100, "Обмеження_на_воду"
problem += 1 * x <= 50, "Обмеження_на_цукор"
problem += 1 * x <= 30, "Обмеження_на_лимонний_сік"
problem += 2 * y <= 40, "Обмеження_на_фруктове_пюре"

# Розв'язання задачі
problem.solve()

# Виведення результатів
print("План виробництва:")
print(f"Лимонад: {x.varValue} одиниць")
print(f"Фруктовий сік: {y.varValue} одиниць")
print(f"Загальне виробництво: {pulp.value(problem.objective)} одиниць")
